; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v2)
		(pred_4 ?v4)
		(pred_5 ?v1)
		(pred_1 ?v1)
		(pred_2 ?v4 ?v1)
		(pred_6)
		(pred_3 ?v4))

   (:action op_2
       :parameters  (?v7 ?v8)
       :precondition (and (not-eq ?v7 ?v8) 
                          (pred_5 ?v7) (pred_5 ?v8) (pred_1 ?v7))
       :effect (and  (pred_1 ?v8)
		     (not (pred_1 ?v7))))


   (:action op_3
       :parameters (?v3 ?v6)
       :precondition  (and  (pred_4 ?v3) (pred_5 ?v6)
			    (pred_2 ?v3 ?v6) (pred_1 ?v6) (pred_6))
       :effect (and (pred_3 ?v3)
		    (not (pred_2 ?v3 ?v6)) 
		    (not (pred_6))))

   (:action op_1
       :parameters  (?v3  ?v6)
       :precondition  (and  (pred_4 ?v3) (pred_5 ?v6)
			    (pred_3 ?v3) (pred_1 ?v6))
       :effect (and (pred_2 ?v3 ?v6)
		    (pred_6)
		    (not (pred_3 ?v3)))))

; problem
(define (problem ferry-l4-c2)
(:domain ferry)
(:objects obj_01 obj_04 obj_05 obj_03 
          obj_06 obj_02 
)
(:init
(pred_5 obj_01)
(pred_5 obj_04)
(pred_5 obj_05)
(pred_5 obj_03)
(pred_4 obj_06)
(pred_4 obj_02)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(pred_6)
(pred_2 obj_06 obj_04)
(pred_2 obj_02 obj_05)
(pred_1 obj_05)
)
(:goal
(and
(pred_2 obj_06 obj_03)
(pred_2 obj_02 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_06 obj_03) (pred_1 obj_01))
    (sometime-before  (pred_2 obj_02 obj_04) (pred_1 obj_01))
  )
)
)

; plan
1. (op_3 obj_02 obj_05)
   deleted: (pred_2 obj_02 obj_05) (pred_6)
   added: (pred_3 obj_02)
   goals met: 0 of 2
2. (op_2 obj_05 obj_01)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_01)
   goals met: 0 of 2
3. (op_1 obj_02 obj_01)
   deleted: (pred_3 obj_02)
   added: (pred_2 obj_02 obj_01) (pred_6)
   goals met: 0 of 2
4. (op_2 obj_01 obj_04)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_04)
   goals met: 0 of 2
5. (op_3 obj_06 obj_04)
   deleted: (pred_2 obj_06 obj_04) (pred_6)
   added: (pred_3 obj_06)
   goals met: 0 of 2
6. (op_2 obj_04 obj_03)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_03)
   goals met: 0 of 2
7. (op_1 obj_06 obj_03)
   deleted: (pred_3 obj_06)
   added: (pred_2 obj_06 obj_03) (pred_6)
   goals met: 1 of 2
8. (op_2 obj_03 obj_01)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_01)
   goals met: 1 of 2
9. (op_3 obj_02 obj_01)
   deleted: (pred_2 obj_02 obj_01) (pred_6)
   added: (pred_3 obj_02)
   goals met: 1 of 2
10. (op_2 obj_01 obj_04)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_04)
   goals met: 1 of 2
11. (op_1 obj_02 obj_04)
   deleted: (pred_3 obj_02)
   added: (pred_2 obj_02 obj_04) (pred_6)
   goals met: 2 of 2
